<?php
/**
 * ----------------------
 * ErrorCode.class.php
 * 
 * User: jian0307@icloud.com
 * Date: 2015/4/19
 * Time: 0:40
 * ----------------------
 */

namespace Lib\SmsLib\Sms189;

/**
 * 天翼开放平台错误代码定义
 *
 * @see http://open.189.cn/sharedata/cms/uploadfile/2013/0813/112357EKSeYFkJMc.rar
 * @package Lib\SmsLib\Sms189
 */
class ErrorCode {
    /**
     * 错误码定义
     * @var array
     */
    static $_ERROR_NO_ = array(
        '0'     =>	'成功',
        '1'     =>	'未知错误',
        '2'	    =>  '服务暂不可用',
        '3'	    =>  '未知的方法',
        '4'	    =>  '接口调用次数已达到设定的上限',
        '5'	    =>  '请求来自未经授权的IP地址',
        '6'	    =>  '无权限访问该用户数据',
        '7'	    =>  '来自该refer的请求无访问权限',
        '100'	=>  '请求参数无效',
        '101'	=>  'api key无效',
        '104'	=>  '无效签名',
        '105'	=>  '请求参数过多',
        '106'	=>  '未知的签名方法',
        '107'	=>  'timestamp参数无效',
        '109'	=>  '无效的用户资料字段名',
        '110'	=>  '无效的access token',
        '111'	=>  'access token过期',
        '210'	=>  '用户不可见',
        '211'	=>  '获取未授权的字段',
        '212'	=>  '没有权限获取用户的email',
        '800'	=>  '未知的存储操作错误',
        '801'	=>  '无效的操作方法',
        '802'	=>  '数据存储空间已超过设定的上限',
        '803'	=>  '指定的对象不存在',
        '804'	=>  '指定的对象已存在',
        '805'	=>  '数据库操作出错，请重试',
        '900'	=>  '访问的应用不存在'
    );
}